# NumColors

## Description
Returns the last used color index in the current document.

```pascal
FUNCTION NumColors : INTEGER;
```

```python
def vs.NumColors():
    return INTEGER
```

## Version
Availability: from VectorWorks13.0

## Category
* Document Attributes